{"meta":{"title":"大惊哥的博客","subtitle":"山川异域，风月同天。","description":"呆头呆脑","author":"大惊哥","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"我玩的不是游戏，是生活","slug":"我玩的不是游戏，是生活","date":"2019-09-16T04:25:33.000Z","updated":"2019-09-24T15:23:58.323Z","comments":true,"path":"2019/09/16/我玩的不是游戏，是生活/","link":"","permalink":"http://yoursite.com/2019/09/16/我玩的不是游戏，是生活/","excerpt":"","text":"序言总感觉这篇日记的名字应该叫做《我与暴雪爸爸的不解之缘》才对，因为细想想看，感觉自己这些年来，花费时间最多的游戏基本都是暴雪出品，比如《暗黑破坏神》，《魔兽争霸》，《炉石传说》等等。但是，今天要说的主角，比这三位的影响力都更大。它就是大名鼎鼎的《魔兽世界》。仿佛暴雪的体系就是建立在《魔兽世界》的基础之上，当然《星际争霸》系列除外。 仿佛一夜之间，大家都玩起了怀旧服。一开始被大多数人唱衰的怀旧服出乎意料地受人欢迎，从一开始的几个服务器，到十几个二十几个服务器，每天人总是爆满的。一方面是跟风，另一方面也是真真切切的想要了解魔兽的世界观，我也迷上了怀旧服，每天再忙也要抽时间上线，做做任务，刷刷怪，因为这样升级才快嘛！ 刚进游戏，我秉着学习的态度，做什么事情都跟郭哥说一声，他毕竟入坑时间比我早，懂的东西也多。这里不懂，问问，那里不懂，瞅瞅，像个刚出生的小孩子。的确是这样，刚刚进入魔兽世界，可不就是个小孩子嘛，连一头猪都打不过的。纯属菜鸟一枚。但是，我毕竟玩的游戏比较多，各种类型的都玩过不少，所以很快就上手了，就这样一晃晃到了二十来级。 我只想做个好人可能暴雪更加强调多人配合的重要性吧。同等级的玩家和怪，1v1的话玩家是肯定能打过的。但是去做一个任务，怪物往往是成群结队，别说是一堆，就算是两个，也不一定能打得过。正应了那句“双拳难敌四手”吧。 这个时候，队友的存在是非常有必要的。 互不认识的两个人，三个人或是更多，为了共同的目的，能够联合起来，共同对抗强大的怪物，有的时候还要联手对抗boss。又有谁享受不到胜利的喜悦和团队的荣耀呢？在野外相遇，看到有人快要被打死，另一个人真的会拔刀相助，哪怕面对的是一群怪物，死也要死在一起。我想，这就是游戏的魅力吧。确切地说，是网络游戏的魅力。他让人在娱乐的同时，能够感受到温暖，这种温暖，让我有足够的勇气在艾泽拉斯大陆上一直走下去，“道之所在，虽千万人，吾往矣”。 但是有一天，我非常不开心。 那天，我们小队里一共有五个人，一个坦克，一个法师，一个牧师，两个盗贼。我是盗贼中的一个。打着打着，跳出来一个“roll”的提示。 （团队在爆出比较好的物品时，往往好多人都想要，暴雪引进了“roll”的机制，如果有需求的话就掷出骰子，点数大的为物品所有者。） 然后，我当时打得正兴奋，完全没有在意，就点需求，着急忙慌地继续打怪去了。任务完成后，队伍就解散了。像往常一样，我回城，然后清理背包。一件蓝色稀有布甲赫然在目。我一看，属性没我原来的好，就想把它卖了换点零花钱。于是挂在世界频道。 当时就有好几个人私信我。 有一个人，说，“布甲给我。”说话毫不客气。 我说，“你出价吧，我第一次卖东西，不知道行情。” 他只来了一个字，滚。然后过了几分钟，又骂了我几句。 这要是一般人，我想可能会对骂，或者直接不理的。但是我不一样。我认真地和他对话，弄清楚到底发生了什么。 原来，这个人是我们当时队伍里的法师。法师一般穿布甲，盗贼一般穿皮甲，如果团队出了装备，是要根据不同的职业确定需求的，不能说谁想要就要，这是不成文的规矩。于是，我屁颠屁颠地给人把装备送过去了。还说了好多诸如“我是新手多包涵”之类的话。 我可能只想做个好人，即使是在游戏里面，我也不愿意去得罪一个人。可能我个人的秉性就是这样吧，无论到了哪里，无论心里有多大的委屈，只会自己默默承担。 游戏里有趣的对话游戏一开始创建角色的时候，是可以按照自己的喜好确定人物形象的。我选择的是盗贼，一个小小的侏儒，梳着双马尾，可爱到可以融化老夫的少女心了哈哈哈~ 有一天，两个侏儒在暴风城相遇了。两个人一样的打扮，一样的职业，甚至连装束都一样。 我是处于好玩，走近他，一步一步与他靠近。他可能也注意到了我，因为我没想到他先开口了。 ——天呐，你真高！ 我想，两个侏儒，噗哈哈哈，他第一句话就把我逗乐了。这句很经典有木有！然后我回了他一句， ——天呐，你真白！ 因为他的人物形象确实比我的白。 两个侏儒在暴风城，你一言，我一语，聊了好多好多。最后要走了，我截了个图，就当是合影留念了。我实在是没想到，原来，这个世界上竟有和我一样的人，脾气一样，喜好一样，说话的方式也一样。 我有点感伤。现实生活中，这样的相遇怎么竟如此不堪一遇呢？如果可以，我想要一场邂逅。这个邂逅，就仿佛戴望舒遇到了丁香姑娘。 她默默地走近 走近，又投出 太息一般的眼光 她飘过 像梦一般地 像梦一般地凄婉迷茫 像梦中飘过 一枝丁香地 我身旁飘过这女郎 今天组队刷怪的时候，遇到了队友，遂闲聊之。 ——五哥，你多大了啊？（他的昵称叫“程以五”，我就瞎叫了句五哥） ——三十一了。 ——我比你小啊！（我说。） ——下了，去给孩子洗澡。（另一个队友说道。） ——好真实啊。 ——是啊。魔兽世界，老男人的游戏了。当年我们玩的时候人可没这么多。 ——当年哪有月卡啊，都是点卡，按时收费的。现在当年那批都工作了，有钱了。暴雪挣来挣去，挣的都是同一批人的钱啊！（另一个队友补充道。） ——时代变了。 （沉默地安心打怪。没人再说什么。） 尾声人和人的性格可真是千差万别。对待游戏的态度也是各不相同。 有的人玩游戏只是为了快感，有的人是为了“慢感”，我自个儿造的词，慢生活，慢慢体会的意思。 有的人玩游戏是为了赚钱，有的人玩游戏是为了休闲。 有的人玩游戏是图个新鲜，有的人是为了怀旧，为了心中的信仰。 有的人在游戏里，因为被敌对阵营杀了之后而性情大变，转而去杀比自己更弱的人。真的应了鲁迅先生的那句话， “勇者愤怒，抽刃向更强者；怯者愤怒，却抽刃向更弱者。”或许这是游戏的另一个功能吧，就是在现实生活中做不到的事情，在游戏里可以肆意发泄。但无论怎么样，游戏而已，无可厚非。 而有的人，在生活中老实巴交，到了游戏里也只想当一个好人，靠自己的本事吃饭，靠自己的双手过活。","categories":[],"tags":[{"name":"心情","slug":"心情","permalink":"http://yoursite.com/tags/心情/"}]},{"title":"我喜欢的一些文言文","slug":"我喜欢的一些文言文","date":"2018-06-05T01:56:27.000Z","updated":"2019-09-24T15:22:47.877Z","comments":true,"path":"2018/06/05/我喜欢的一些文言文/","link":"","permalink":"http://yoursite.com/2018/06/05/我喜欢的一些文言文/","excerpt":"","text":"茕茕白兔，东奔西顾。衣不如新，人不如故。 -《古艳歌》 好一似食尽鸟投林，落了片白茫茫大地真干净。 -《红楼梦》结尾 都道是金玉良姻，俺只念木石前盟。空对着，山中高士晶莹雪；终不忘，世外仙姝寂寞林。叹人间，美中不足今方信：纵然是齐眉举案，到底意难平。 -《终身误》 水之积也不厚，则其负大舟也无力。 -《逍遥游》 适莽苍者，三餐而反，腹犹果然；适百里者，宿舂粮；适千里者，三月聚粮。 -《逍遥游》 举世誉之而不加劝，举世非之而不加沮，定乎内外之分，辩乎荣辱之境，斯已矣。 -《逍遥游》 山川异域，风月同天。 -长屋《绣袈裟衣缘》 夫人之相与，俯仰一世，或取诸怀抱，悟言一室之内；或因寄所托，放浪形骸之外。虽趣舍万殊，静躁不同，当其欣于所遇，暂得于己，快然自足，不知老之将至。及其所之既倦，情随事迁，感慨系之矣。向之所欣，俯仰之间，已为陈迹，犹不能不以之兴怀。况修短随化，终期于尽。古人云：“死生亦大矣。”岂不痛哉！ -《兰亭集序》 一死生为虚诞，齐彭殇为妄作。后之视今，亦犹今之视昔。悲夫！ -《兰亭集序》 苏子愀然，正襟危坐，而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞。’此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。” -《赤壁赋》 嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！ -《滕王阁序》 忧劳可以兴国，逸豫可以亡身，自然之理也。 -《伶官传序》 故方其盛也，举天下豪杰，莫能与之争；及其衰也，数十伶人困之，而身死国灭，为天下笑。夫祸患常积于忽微，而智勇多困于所溺，岂独伶人也哉？ -《伶官传序》 知我者，谓我心忧；不知我者，谓我何求。 -《黍离》 安得广厦千万间，大庇天下寒士俱欢颜，风雨不动安如山。呜呼！何时眼前突兀见此屋，吾庐独破受冻死亦足！ -《茅屋为秋风所破歌》 亦余心之所善兮，虽九死其犹未悔。忳郁邑余侘傺兮，吾独穷困乎此时也。宁溘死以流亡兮，余不忍为此态也。虽体解吾犹未变兮，岂余心之可惩。 -《离骚》 庭有枇杷树，吾妻死之年所手植也，今已亭亭如盖矣。 -《项脊轩志》 夫专诸之刺王僚也，彗星袭月；聂政之刺韩傀也，白虹贯日；要离之刺庆忌也，仓鹰击于殿上。此三子者，皆布衣之士也，怀怒未发，休祲降于天，与臣而将四矣。若士必怒，伏尸二人，流血五步，天下缟素，今日是也。 -《唐雎不辱使命》 盖余所至，比好游者尚不能十一，然视其左右，来而记之者已少。盖其又深，则其至又加少矣。 -《游褒禅山记》 古人之观于天地、山川、草木、虫鱼、鸟兽，往往有得，以其求思之深而无不在也。夫夷以近，则游者众；险以远，则至者少。而世之奇伟、瑰怪，非常之观，常在于险远，而人之所罕至焉，故非有志者不能至也。有志矣，不随以止也，然力不足者，亦不能至也。有志与力，而又不随以怠，至于幽暗昏惑而无物以相之，亦不能至也。然力足以至焉，于人为可讥，而在己为有悔；尽吾志也而不能至者，可以无悔矣，其孰能讥之乎？此余之所得也！ -《游褒禅山记》","categories":[],"tags":[{"name":"摘录","slug":"摘录","permalink":"http://yoursite.com/tags/摘录/"}]},{"title":"Hexo安装及常用配置","slug":"Hexo安装及常用配置","date":"2018-06-04T02:24:04.000Z","updated":"2019-09-24T15:24:33.366Z","comments":true,"path":"2018/06/04/Hexo安装及常用配置/","link":"","permalink":"http://yoursite.com/2018/06/04/Hexo安装及常用配置/","excerpt":"","text":"Hexo 安装方法在 Archlinux 中，输入以下命令： sudo pacman -S nodejs sudo pacman -S npm npm install -g hexo-cli npm install hexo-deployer-git --save其中，最后一行是为了使用 deploy 命令进行在 Github 上的部署。 在 Windows 中，只需要去 node.js 官网下载安装即可。通常 node.js 自带 npm 。 Github 配置第一步，在 Github 中，新建一个库，库的名字为 username.github.io，username 为在 Github 上的用户名。在这里我的名字为 openkam.github.io。 第二步，添加 ssh 密钥。本机运行如下命令： ssh-keygen -t rsa -C &quot;xxxxxx@yy.com&quot;替换成自己的邮箱即可。而后在 ~/.ssh 文件夹中，找到 id_rsa.pub 文件，打开后粘贴到 Github - Settings - SSH and GPG keys - New SSH key 中。这样我们的公钥就添加到了自己的 Github 中。 第三步，本机配置。在终端中运行以下命令设置本机的用户名和邮箱： git config --global user.name &quot;Furzoom&quot; git config --global user.email &quot;example@ex.com&quot;Hexo 配置要开始一个新项目，运行以下命令： hexo init foldername其中 foldername 为项目的文件夹名称。 程序自动生成了一系列文件。其中，_config.yml 文件为站点的配置文件。要应用主题，我们下载好了 suka 主题，放在了 themes 文件夹里。 下面就我个人进行的配置，分别进行了阐述。 站点配置基本的网页配置属性如下： title: 大惊哥的博客 subtitle: Awesome. description: 此人很懒，只想瞎写。喜欢Python，喜欢偷懒。 keywords: author: 赵麟 language: zh-CN timezone:其中，title 为站点的主标题，subtitle 为副标题，这些只是对网站的描述。language 一项最为重要，决定了下文中主题的语言。 在 theme 一项中，后面设置为 suka 主题的文件夹名称，即站点文件夹下的 themes 文件夹里 suka 文件夹名称。 在配置文件的最后，为站点部署的设置。我本人的具体配置如下： deploy: type: git repo: git@github.com:openkam/openkam.github.io.git branch: mastersuka 主题配置具体见 https://theme-suka.skk.moe/docs/ 暂时就到这里。","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"http://yoursite.com/tags/hexo/"},{"name":"心得","slug":"心得","permalink":"http://yoursite.com/tags/心得/"},{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"}]}]}